# ASCIIは、American Standard Code for Information Interchangeの略
# ASCIIは、文字コードの一種で、英数字や記号などをコンピュータで扱えるように、それぞれの文字に対して数値を割り当てたもの

# Shift_JISは、ASCIIに日本語を追加した文字コードの一種

# Unicodeは、世界中の文字を単一文字集合として扱う符号化文字集合規格
# 規格なだけで、符号化して、他のコンピュータに読み込むには、デコードする必要がある

# UTF-8は、Unicodeの一種で、ASCIIコードに世界中の文字を加えたもの
# ASCIIコードだけでは表現しきれない日本語にも対応
# 世界中のあらゆる文字に対応しているため、世界標準の文字コード

# バイト列 先頭にbをつける
# 1バイトのデータを連ねた塊。ファイル入出力やデータ送受信、暗号化、データ圧縮など、
# 扱うデータの型や形式などに立ち入らずに、任意のデータを単なるビットパターンの連なりとして汎用的に処理する場合に用いられるデータ型
# 0と1の並びを、1桁ずつ「何ビット」という単位で考えればバイナリ列。8桁ずつ「何バイト」と考えればバイト列


# Base64
# データを64種類の印字可能な英数字のみを用いて、
# それ以外の文字を扱うことの出来ない通信環境にてマルチバイト文字やバイナリデータを扱うためのエンコード方式である。

#